In [ ]:
# dplyr, at its core, consists of 5 functions

    # filter() selects rows based on their values

    # mutate() creates new variables

    # select() picks columns by name

    # summarise() calculates summary statistics

    # arrange() sorts the rows


# Relational operators are used to compare values. In R generally (and in dplyr specifically), those are:

    # == (Equal to)
    # != (Not equal to)
    # < (Less than)
    # <= (Less than or equal to)
    # > (Greater than)
    # >= (Greater than or equal to

# logical operators

    # ! (logical NOT)
    # & (logical AND)
    # | (logical OR)

# additional operators

    # %in% : Checks if a value is in an array of multiple values
    # is.na() : Checks whether a value is NA

In [ ]:
# %>% is called the forward pipe operator in R. 

# It provides a mechanism for chaining commands with a new forward-pipe operator, %>%.

In [ ]:
1. Select Rows based on Column Value
    df[df$gender == 'M',]

2. Select Rows by list of Column Values
    df[df$state %in% c('CA','AZ','PH'),]

3. Select Rows based on Multiple Columns
    df[df$gender == 'M' & df$id > 15,]

4. Using is.element() to Select Rows by Column Values
    df[is.element(df$state, c('CA','AZ','PH')),]

5. Using subset()
    subset(df, state %in% c("CA", "AZ", "PH"))

6. Using dplyr::filter()

    ibrary(dplyr)
    dplyr::filter(df, state %in% c("CA", "AZ", "PH"))

7. Using data.table

    library(data.table)
    setDT(df, key = 'state')[J(c("CA", "AZ", "PH"))]

In [29]:
read.csv("sampledata\\vehicle.csv") -> data

dim(data)

[1] 1624    7

In [3]:
head(data,3)

  Vehicle fm Mileage lh  lc     mc     State
1 1        0   863   1.1  66.30 697.23 MS
2 2       10  4644   2.4 233.03 119.66 CA
3 3       15 16330   4.2 325.08 175.46 WI

In [ ]:
# ‘%>%’ (pipe) forward

In [2]:
names(data)

[1] "Vehicle" "fm"      "Mileage" "lh"      "lc"      "mc"      "State"

## Selection based on a single comparative condition on a column

In [10]:
head(data[data$'State' == 'CA',],6)

   Vehicle fm Mileage lh  lc     mc     State
2   2      10  4644   2.4 233.03 119.66 CA
22 22      11 20694   2.3 194.48 119.66 CA
41 41       4  3879   1.8 122.25 175.46 CA
45 45       4  6244   3.3 267.30 204.95 CA
48 48      15 13394   4.1 325.92 171.04 CA
64 64      13 28305   1.3 107.10 175.46 CA

## Selection based on multiple comparative conditions on a column

In [35]:
# Simple Filter using []

head(data[data$'State' %in% c ('CA','MS'),],6)

   Vehicle fm Mileage lh  lc     mc     State
1   1       0   863   1.1  66.30 697.23 MS
2   2      10  4644   2.4 233.03 119.66 CA
22 22      11 20694   2.3 194.48 119.66 CA
41 41       4  3879   1.8 122.25 175.46 CA
45 45       4  6244   3.3 267.30 204.95 CA
48 48      15 13394   4.1 325.92 171.04 CA

## Multi Condition

In [32]:
head(data[data$State == 'MS' & data$lc > 50,])

    Vehicle fm Mileage lh   lc     mc     State
1     1      0   863    1.1  66.30 697.23 MS
56   56     13 90325    0.8  50.85 119.66 MS
93   93     21 37693   14.3 871.43 401.10 MS
305 305     13 17185    1.9 141.77 192.71 MS
864 864      5 10070    1.6  89.28 317.75 MS
971 971     10 27353    1.6  89.28 119.66 MS

In [33]:
data2 = data[data$State %in% c("MS","OR") & data$lc > 200,]

head(data2,5)

    Vehicle fm Mileage lh   lc     mc     State
93   93     21 37693   14.3 871.43 401.10 MS
205 205     13 38255    9.0 628.93 421.41 OR
343 343     10 17464    3.7 236.80 119.66 OR
352 352     16 48424    7.7 564.04 179.79 OR
396 396     12  6724    6.7 529.02 119.66 OR

In [ ]:
# Using subset()

# Subset : The subset() method is concerned with the rows. The row numbers are retained while applying this method.

In [34]:
head(subset(data, State == 'MS'))

    Vehicle fm Mileage lh   lc     mc     State
1     1      0   863    1.1  66.30 697.23 MS
56   56     13 90325    0.8  50.85 119.66 MS
93   93     21 37693   14.3 871.43 401.10 MS
305 305     13 17185    1.9 141.77 192.71 MS
864 864      5 10070    1.6  89.28 317.75 MS
971 971     10 27353    1.6  89.28 119.66 MS

In [37]:
data2 = subset(data, State %in% c("MS","OR") | lc > 200)

print(head(data2,5))

  Vehicle fm Mileage  lh     lc     mc State
1       1  0     863 1.1  66.30 697.23    MS
2       2 10    4644 2.4 233.03 119.66    CA
3       3 15   16330 4.2 325.08 175.46    WI
4       4  0      13 1.0  66.64   0.00    OR
5       5 13   22537 4.5 328.66 175.46    AZ

## Using dplyr library

In [38]:
library("dplyr")

# 01 Filter data where State is 'CA'  : Single Condition
# Filtering by one criterion
data2 = data %>% filter(State == "CA")

head(data2,4)

  Vehicle fm Mileage lh  lc     mc     State
1  2      10  4644   2.4 233.03 119.66 CA
2 22      11 20694   2.3 194.48 119.66 CA
3 41       4  3879   1.8 122.25 175.46 CA
4 45       4  6244   3.3 267.30 204.95 CA

In [39]:
library(dplyr)

head(filter(data,data$State == 'CA'))

  Vehicle fm Mileage lh  lc     mc     State
1  2      10  4644   2.4 233.03 119.66 CA
2 22      11 20694   2.3 194.48 119.66 CA
3 41       4  3879   1.8 122.25 175.46 CA
4 45       4  6244   3.3 267.30 204.95 CA
5 48      15 13394   4.1 325.92 171.04 CA
6 64      13 28305   1.3 107.10 175.46 CA

In [36]:
head(dplyr::filter(data,data$State == 'CA'))

  Vehicle fm Mileage lh  lc     mc     State
1  2      10  4644   2.4 233.03 119.66 CA
2 22      11 20694   2.3 194.48 119.66 CA
3 41       4  3879   1.8 122.25 175.46 CA
4 45       4  6244   3.3 267.30 204.95 CA
5 48      15 13394   4.1 325.92 171.04 CA
6 64      13 28305   1.3 107.10 175.46 CA

In [26]:
head(filter(data,data$State %in% c('CA','MS')))

  Vehicle fm Mileage lh  lc     mc     State
1  1       0   863   1.1  66.30 697.23 MS
2  2      10  4644   2.4 233.03 119.66 CA
3 22      11 20694   2.3 194.48 119.66 CA
4 41       4  3879   1.8 122.25 175.46 CA
5 45       4  6244   3.3 267.30 204.95 CA
6 48      15 13394   4.1 325.92 171.04 CA

## Using Subset

In [28]:
# Filter DataFrame by column name id and name.
subset(data,State == 'MS',select = c('lh','lc'))

     lh   lc
1     1.1  66.30
56    0.8  50.85
93   14.3 871.43
305   1.9 141.77
864   1.6  89.28
971   1.6  89.28
1033  1.2  71.02
1148  1.0  55.50
1159  8.1 604.41
1178  2.6 189.10
1238  1.2  69.88
1293  1.4  77.70
1295  0.7  46.13

In [37]:
data[is.element(data$state, c('CA','AZ','PH')),]

     Vehicle fm Mileage lh lc mc State

In [2]:
read.csv("sampledata\\vehicle.csv") -> data

head(data,5)

  Vehicle fm Mileage lh  lc     mc     State
1 1        0   863   1.1  66.30 697.23 MS
2 2       10  4644   2.4 233.03 119.66 CA
3 3       15 16330   4.2 325.08 175.46 WI
4 4        0    13   1.0  66.64   0.00 OR
5 5       13 22537   4.5 328.66 175.46 AZ

In [16]:
library(dplyr)

df = data %>% filter(data$State == 'CA')

head(df)

  Vehicle fm Mileage lh  lc     mc     State
1  2      10  4644   2.4 233.03 119.66 CA
2 22      11 20694   2.3 194.48 119.66 CA
3 41       4  3879   1.8 122.25 175.46 CA
4 45       4  6244   3.3 267.30 204.95 CA
5 48      15 13394   4.1 325.92 171.04 CA
6 64      13 28305   1.3 107.10 175.46 CA

### Select Columns by applying filter with a value

In [18]:
data2 = data %>% 
         select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
         filter(State == "MS")

head(data2,5)

  Vehicle fm Mileage lh   lc     mc     State
1   1      0   863    1.1  66.30 697.23 MS
2  56     13 90325    0.8  50.85 119.66 MS
3  93     21 37693   14.3 871.43 401.10 MS
4 305     13 17185    1.9 141.77 192.71 MS
5 864      5 10070    1.6  89.28 317.75 MS

In [19]:
data2 = data %>% 
         select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
         filter(State == "MS" & lc > 200)

head(data2,5)

  Vehicle fm Mileage lh   lc     mc     State
1   93    21 37693   14.3 871.43 401.10 MS
2 1159    10 32462    8.1 604.41 500.69 MS

In [20]:
data2 = data %>% 
         select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
         filter(State != "MS" & lc > 200)

head(data2,5)

  Vehicle fm Mileage lh  lc     mc     State
1 2       10  4644   2.4 233.03 119.66 CA
2 3       15 16330   4.2 325.08 175.46 WI
3 5       13 22537   4.5 328.66 175.46 AZ
4 6       21 40931   3.1 205.28 175.46 FL
5 8        5 11051   2.9 208.80 270.04 GA

In [21]:
data2 = data %>% 
        select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
        filter(State %in% c(read.csv("sampledata\\vehicle.csv")))

head(data2,5)

     Vehicle fm Mileage lh lc mc State

In [25]:
data2 = data %>% 
        select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
        filter(State %in% c("CA","WI")) %>%
        count(State)

print(head(data2,5))

  State   n
1    CA 200
2    WI  13

In [31]:
# Reverse the condition logic

data2 = data %>% 
        select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
        filter(!State %in% c("CA","WI")) %>%
        count(State)

head(data2,5)

  State n
1 *      1
2 AK     4
3 AL    26
4 AR     9
5 AZ    61

In [29]:
data2 = data %>% 
        select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
        filter(is.na('State'))

head(data2,5)

     Vehicle fm Mileage lh lc mc State

In [30]:
data2 = data %>% 
        select('Vehicle','fm','Mileage','lh','lc','mc','State') %>%
        filter(!is.na('State'))

head(data2,5)

  Vehicle fm Mileage lh  lc     mc     State
1 1        0   863   1.1  66.30 697.23 MS
2 2       10  4644   2.4 233.03 119.66 CA
3 3       15 16330   4.2 325.08 175.46 WI
4 4        0    13   1.0  66.64   0.00 OR
5 5       13 22537   4.5 328.66 175.46 AZ

In [40]:
# 02 Filter data where State is 'CA'  : Multi Condition

data2 = data %>% 
          filter(State == "CA" | State == "TX" | State == "FL")

head(data2,4)

  Vehicle fm Mileage lh   lc     mc     State
1  2      10  4644    2.4 233.03 119.66 CA
2  6      21 40931    3.1 205.28 175.46 FL
3 11      17 24879    3.5 260.29 119.66 TX
4 13      14 29782   10.0 695.10 228.12 FL

In [41]:
# 02 Filtering by multiple criteria within a single logical expression

data2 = data %>% 
          filter(State == "CA" & lc > 200 & lh > 4 | fm > 8)
head(data2,4)

  Vehicle fm Mileage lh  lc     mc     State
1 2       10  4644   2.4 233.03 119.66 CA
2 3       15 16330   4.2 325.08 175.46 WI
3 5       13 22537   4.5 328.66 175.46 AZ
4 6       21 40931   3.1 205.28 175.46 FL

In [42]:
# 03 Filter data as like above and add arrange function on other varibale

data2 = data %>% 
          filter(State == "CA" | State == "TX" | State == "FL") %>%
          arrange(desc('Mileage'))

head(data2)

  Vehicle fm Mileage lh   lc     mc     State
1  2      10  4644    2.4 233.03 119.66 CA
2  6      21 40931    3.1 205.28 175.46 FL
3 11      17 24879    3.5 260.29 119.66 TX
4 13      14 29782   10.0 695.10 228.12 FL
5 19      12 44865    4.9 319.51 119.66 FL
6 22      11 20694    2.3 194.48 119.66 CA

In [43]:
# 04 Filter data by applying Statistical Info

data %>%
  summarise(Avg_lc = mean(lc),
            sd_lc = sd(lc),
            max_lc = max(lc),
            min_lc = min(lc),
            sum_lc = sum(lc),
            median_lc = median(lc),
            total = n())

  Avg_lc  sd_lc    max_lc  min_lc sum_lc   median_lc total
1 242.918 219.5726 3234.41 0      394498.8 195.595   1624

In [44]:
# Get the data where lc value is greater than the mean of lc

data2 <-  data %>%
            filter (data$lc > mean(data$lc,na.rm = TRUE))

print(head(data2))

  Vehicle fm Mileage   lh     lc     mc State
1       3 15   16330  4.2 325.08 175.46    WI
2       5 13   22537  4.5 328.66 175.46    AZ
3      11 17   24879  3.5 260.29 119.66    TX
4      13 14   29782 10.0 695.10 228.12    FL
5      15 13   21946  3.8 312.36 175.46    MA
6      19 12   44865  4.9 319.51 119.66    FL

In [45]:
#

data2 = data %>% 
          select(-starts_with("user."), -starts_with("milestone."), 
         -starts_with("pull_"), -ends_with("url"))

head(data2,10)

   Vehicle fm Mileage lh  lc     mc     State
1   1       0   863   1.1  66.30 697.23 MS
2   2      10  4644   2.4 233.03 119.66 CA
3   3      15 16330   4.2 325.08 175.46 WI
4   4       0    13   1.0  66.64   0.00 OR
5   5      13 22537   4.5 328.66 175.46 AZ
6   6      21 40931   3.1 205.28 175.46 FL
7   7      11 34762   0.7  49.17 145.20 LA
8   8       5 11051   2.9 208.80 270.04 GA
9   9       8  7003   3.4 212.06 119.66 WA
10 10       1    11   0.7  44.43   0.00 PA

In [46]:
# Filter dataframe if the column type is numneric
dats2 <- data %>% 
    select_if(is.numeric)

head(data2,10)

   Vehicle fm Mileage lh  lc     mc     State
1   1       0   863   1.1  66.30 697.23 MS
2   2      10  4644   2.4 233.03 119.66 CA
3   3      15 16330   4.2 325.08 175.46 WI
4   4       0    13   1.0  66.64   0.00 OR
5   5      13 22537   4.5 328.66 175.46 AZ
6   6      21 40931   3.1 205.28 175.46 FL
7   7      11 34762   0.7  49.17 145.20 LA
8   8       5 11051   2.9 208.80 270.04 GA
9   9       8  7003   3.4 212.06 119.66 WA
10 10       1    11   0.7  44.43   0.00 PA